# - створити функцію яка виводить ліст
# - створити функцію яка приймає три числа та виводить та повертає найменьше.
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
# - створити функцію яка виводить ліст
# - створити функцію яка повертає найбільше число з ліста
# - створити функцію яка повертає найменьше число з ліста
# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

def print_list(lst):
    print(' '.join(map(str, lst)))


def min_of_three(a, b, c):
    print(min(a, b, c))
    return min(a, b, c)


def max_of_three(a, b, c):
    print(max(a, b, c))
    return max(a, b, c)


def min_max(*args):
    print(max(args))
    return min(args)


def list_max(lst):
    return max(lst)


def list_min(lst):
    return min(lst)


def list_sum(lst):
    return sum(lst)


def list_average(lst):
    return sum(lst) / len(lst)



